const express = require('express');
const app = express();

app.listen(3000, function() {
	console.log('█████ ███  ████ █  █ ███ ███   ████  ████ █  █  █ █  █ █    ████ ████ ████  ███ ███');
	console.log('  █   █  █ █  █ ██ █ █   █▄▄   █   █ █  █ █  █  █ ██ █ █    █  █ █  █ █   █ █▄▄ █  █');
	console.log('  █   ███  ████ █ ██ █   █▀▀   █   █ █  █ █ █ █ █ █ ██ █    █  █ ████ █   █ █▀▀ ███');
	console.log('  █   █  █ █  █ █  █ ███ ███   ████  ████ ██   ██ █  █ ████ ████ █  █ ████  ███ █  █');
});

app.use(express.static('./public', {
	index: 'scroll1.html'
}));

app.use('/', require('./routes'));